/*6. Напишіть функцію, яка порівнює два введених числа і результат видає у
вигляді знаків >, < або =
*/


function comparing(){
    let a6,b6,c6;
    a6=+prompt(">> Перше число");
    b6=+prompt(">> Друге число");
    if (a6>b6) c6=">";
    else if (a6<b6) c6="<";
    else c6="=";
    return (a6+" "+c6+ " "+b6);
}
alert(comparing());


/*
7. Напишіть функцію, яка обчислює корені квадратного рівняння. В якості
аргументів вона бере коефіцієнти (a, b, c), а повертає значення за умовою (x1
і x2, або «Коренів немає», або а = 0 «введені не коректні дані»).
*/


let a,b,c,D,x1,x2;
function kvadrrivn(a,b,c){
    D=Math.pow(b,2)-4*a*c;
    //console.log(D,a,b,c);
    if (D<0) return ("квадратне рівняння з значеннями: a= "+a+", b= "+b+", c= "+c+ " - немає дійсних коренів ");
    else if (D==0) {
        x1=(-b+Math.sqrt(D))/(2*a);
        return ("квадратне рівняння з значеннями: a= "+a+", b= "+b+", c= "+c+ " - має 2 однакових корені, вони рівні: х1= "+x1+", x2= "+x1);
    }
    else if (D>0) {
        x1=(-b+Math.sqrt(D))/(2*a);
        x2=(-b-Math.sqrt(D))/(2*a);
        return ("квадратне рівняння з значеннями: a= "+a+", b= "+b+", c= "+c+ " - має 2 різних корені, вони рівні: х1= "+x1+", x2= "+x2)
    }
}
do {
    a=+prompt("a>> (a!==0)");
} while (a==false);
b=+prompt("b>>");
c=+prompt("c>>");
alert(kvadrrivn(a,b,c));


/*
8. Напишіть функцію, яка знаходить із чисел (переданих у функцію) числа,
які більше середнього арифметичного цих чисел.
*/


let x8;
function serednarufm(){
let mas8=[],mas81=[],ser,sum=0;
for (let i8=0;i8<=x8-1;i8++){
    k=i8+1;
    mas8[i8]=+prompt("Введіть "+k+" елемент числового ряду з "+x8);
    sum+=mas8[i8];
    console.log(mas8,sum);
}
ser=sum/x8;
for (let i8=0;i8<=x8-1;i8++){
    if (mas8[i8]>ser) {
        mas81.push(mas8[i8]);
        console.log(mas81);
    }    
    }
return ("В масиві чисел: "+mas8+ " середнє арифметичне = "+ser+". При цьому числа з цього масиву, які більше середнього арфметичного = "+ mas81);
}
x8=+prompt("Скільки буде чисел для виконання обчислень?");
alert(serednarufm(x8));

/*
9. Напишіть функцію, яка обчислює суму чисел, які кратні 5 - в діапазоні від
а до b
*/


let a9,b9;
function kratnist(a,b){
let sum9=0,count9=0;
for (let i9=a9;i9<=b9;i9++) {
    if (i9%5==0){
        sum9+=i9;
        count9++;
    }
}
if (count9==0) return ("В діапазоні числового ряду від: "+a9+" до "+b9+ ", не має чисел кратних 5");
else return ("В діапазоні числового ряду від: "+a9+" до "+b9+ ", маємо -"+count9+" числа(число) кратне 5, при цьому сума подібних становить: "+sum9);
}
a9=prompt('>> початок діапазону');
do {
    b9=prompt('>> кінець діапазону (b>a)');
} while (b9<a9);
alert(kratnist(a9,b9));


//10. Напишіть функцію, яка друкує всі цілі числа в діапазоні від 1 до N

function Cili4isla(N10){
    for (let i10=1;i10<=N10;i10++){
        console.log(i10);
    }
    return ("Для відображення результату - відкрий консоль")
}
do {
    N10=+prompt('>> кінець діапазону (від 1 до N');
} while (N10<=1);
alert(Cili4isla(N10));
